[
  {
    "title": "APT37组织通过RoKRAT恶意软件采用无文件攻击的活动持续增长",
    "txt": "Genius安全中心(GSC)发现了进入2024年以来监测发现多起APT37威胁活动。他们与Lazarus、Kimsuky和Konni一样，是以亚洲或韩国为对象，疑似有国家背景支持网络攻击组织之一。APT37主要针对朝鲜人权团体、朝鲜采访记者、脱北者等主要对朝领域从业者，持续进行攻击。通过对每个案例的深入分析，GSC发现嵌入在LNK文件中的PowerShell命令在最初的攻击中被一致使用。从威胁参与者的角度来看，这可能已被证明在逃避防病毒检测方面有些有效。此外，加密的\nRoKRAT\n恶意软件以无文件方式执行，以收集终端信息并将其秘密泄露到海外云服务器。截至1-2月份，在韩国观察到的最初渗透类型是鱼叉式网络钓鱼。电子邮件传播的攻击仍然有效，并且对于威胁参与者来说是一种具有成本效益的策略。我们不能忽视从按学科定位目标筛选到配置自定义场景的快速简便的访问。在这种攻击中，诱导恶意文件的执行是一个非常重要的过程。初始攻击场景是在主设备上安装了特定防病毒产品的假设下设计的。因此，威胁参与者准备绕过基于签名的检测，以逃避这些第一线防御。",
    "reference": "https://www.genians.co.kr/blog/threat_intelligence/rokrat"
  },
  {
    "title": "Starry Addax组织使用新恶意软件针对北非展开网络攻击",
    "txt": "思科Talos披露了一个新的网络攻击组织，将其称为“Starry Addax”，攻击目标主要是与阿拉伯撒哈拉民主共和国(SADR)事业相关的人权活动人士，并使用一种新型移动恶意软件。Starry Addax进行网络钓鱼攻击，诱骗目标安装称之为“FlexStarling”的恶意Android应用程序。对于基于Windows的目标，Starry Addax会将提供伪装成流行媒体网站登录页面的凭据收集页面。Talos最近分析的恶意移动应用程序(APK)“FlexStarling”伪装成Sahara Press Service (SPRASD)应用程序的变体。撒哈拉新闻社是与阿拉伯撒哈拉民主共和国有联系的媒体机构。该恶意软件将从SPRASD网站提供西班牙语内容，以使受害者看起来合法。然而，实际上，FlexStarling是一种高度通用的恶意软件，能够部署额外的恶意软件组件并从受感染的设备窃取信息。",
    "reference": "https://blog.talosintelligence.com/starry-addax/"
  },
  {
    "title": "参考来源：",
    "txt": "https://www.proofpoint.com/us/blog/threat-insight/latrodectus-spider-bytes-ice\n黑客声称破坏了包含数千条俄罗斯犯罪记录的数据库\n一群名为RGB-TEAM的黑客行动主义者声称对入侵俄罗斯总检察长的网站负责，暴露了过去30年在俄罗斯犯下的刑事犯罪数据。该组织周四在其Telegram频道上公布了泄露的档案，称其持有1993年至2022年的10万份俄罗斯犯罪记录。黑客们表示，这只是他们在侵入检察长网站后获得的部分数据。根据俄罗斯独立调查媒体“重要故事”（Important Stories）的说法，该媒体分析了泄露数据的随机样本，该数据库确实包含有关犯罪的真实俄罗斯人的信息。该媒体报道说，其中很大一部分案件涉及盗窃、贩毒以及侮辱警察。俄罗斯总检察长尚未对泄密事件公开发表评论，也没有回应记者的置评请求。RGB-TEAM是一个以前不为人知的讲俄语的威胁行为者。他们将自己描述为“一个为自由而战的匿名黑客行动主义者社区”。",
    "reference": "https://therecord.media/hackers-claim-to-breach-russia-prosecutor-general-database"
  },
  {
    "title": "“游蛇”黑产近期攻击活动分析",
    "txt": "“游蛇”黑产自2022年下半年开始活跃至今，针对国内用户发起了大量钓鱼攻击和诈骗活动。该类黑产传播的恶意程序变种多、更新免杀手段快、更换基础设施频繁、攻击目标所涉及的行业广泛。近期，安天CERT监测到“游蛇”黑产针对与金融、财务相关的企业及人员进行的攻击活动。攻击者投放的初始恶意文件主要有三类：可执行程序、CHM文件、商业远控软件“第三只眼”，伪造的文件名称大多与财税、资料、函件等相关。由于商业远控软件“第三只眼”提供多方面的远程监控及控制功能，并且将数据回传至厂商提供的子域名服务器、根据qyid值识别控制端用户，攻击者无需自己搭建C2服务器，因此恶意利用该软件进行的攻击活动近期呈现活跃趋势。“游蛇”黑产仍在频繁地对恶意软件、免杀手段以及相关基础设施进行更新，每天依旧有一定数量的用户遭受攻击并被植入远控木马。",
    "reference": "https://www.antiy.cn/research/notice&report/research_report/SwimSnake_Analysis_202404.html"
  },
  {
    "title": "太平洋嘉德人寿保险公司遭受网络攻击，16.5万人的财务信息被盗",
    "txt": "美国夏威夷太平洋嘉德人寿保险公司表示，在2023年遭受网络袭击中，16.5万人的敏感财务信息被网络犯罪分子窃取。被盗信息包括社会安全号码、财务账户信息、医疗信息等。这家保险巨头成立于1961年，在46个州拥有数千名客户。这起事件延续了持续不断的违规行为，影响了数百万使用美国公司服务或为美国公司工作的客户。“2023年9月5日，PGL在其电子邮件环境中发现了可疑活动，”该公司表示，并解释说，对该事件的调查于3月5日结束。",
    "reference": "https://therecord.media/pacific-guardian-life-insurance-data-breach"
  },
  {
    "title": "卡巴斯基粉丝俱乐部论坛57,000用户数据泄露",
    "txt": "网络安全巨头\n卡巴斯基\n的俄语粉丝俱乐部论坛经历了一次数据泄露事件，在此期间，一个名为RGB的黑客组织在网上泄露了56,798名用户的个人数据。粉丝俱乐部论坛forum.kasperskyclub.ru拥有超过62,364个帖子，使其成为一个非常活跃的平台，用户可以在其中讨论卡巴斯基实验室及其产品、分享教程并寻求故障排除帮助。然而，尽管是非官方的，但粉丝俱乐部的数据泄露并不排除卡巴斯基员工数据的存在。根据Hackread.com获得的信息，数据泄露发生在2024年3月24日，但数据直到2024年4月4日才泄露。泄露的数据库出现在RGB的官方网站上，后来又出现在Bre\nach Forums和Telegram上。经分析，其中包含论坛用户的个人信息，包括以下数据：\n全名\nIP 地址\n电子邮件地址\n密码哈希",
    "reference": "https://www.hackread.com/57000-kaspersky-fan-club-forum-data-breach/"
  }
]