[
  {
    "title": "APT组织Lazarus Group针对软件供应商部署SIGNBT恶意软件",
    "txt": "近期，卡巴斯基的研究人员发现具有朝鲜背景的APT组织，Lazarus Group正持续地对软件供应商发起攻击活动。攻击者采用先进的安全规避技术，引入SIGNBT恶意软件来控制受害者。此外，研究人员还在受害主机的内存中发现了Lazarus组织著名的LPEClient恶意软件，该恶意软件此前曾在针对国防承包商和加密货币行业的攻击中出现。SIGNBT加载器是一个shellcode文件，可在内存中启动Windows可执行文件。攻击者使用各种策略来建立和维护受害主机的持久性。其中包括在系统文件夹中创建一个名为ualapi.dll的文件，该文件由spoolsv.exe进程在每次系统启动时自动加载。SIGNBT恶意软件通过加载程序启动，该加载程序专门在内存中运行。执行后，恶意软件在初始化其配置数据后发送信号，开始与C2服务器通信。在其通信中，恶意软件使用以SIGNBT开头的独特字符串。该恶意软件还使用一种特定机制来验证从C2服务器接收到的响应数据，软件会检查响应数据是否包含硬编码的HTML脚本。在验证过程中，恶意软件使用base64解码来自C2服务器的前12个字节，用加号替换空格以创建七个字符的字符串。然后对接下来的12个字节重复此过程，随后对每组的前七个字符进行异或并与\"success\"字符串进行比较。此重复过程应用于每个HTTP通信序列，以验证响应是否符合预期的\"success\"字符串。恶意软件发送带有SIGNBTKE标头的HTTP请求，如果它从C2服务器收到\"success\"消息，它会激活CCBrush类中的getInfo函数。此功能会收集有关受害者计算机的各种信息，例如计算机名称、产品名称、操作系统详细信息、系统正常运行时间、CPU信息、系统区域设置、时区、网络状态和恶意软件配置数据。最终接受并执行C2服务器的各类命令。攻击链图如下图所示。\n",
    "reference": "https://securelist.com/unveiling-lazarus-new-campaign/110888/"
  },
  {
    "title": "APT组织Yellow Liderc使用IMAPLoader恶意软件开展攻击",
    "txt": "\nYellow Liderc是一个具有伊朗背景的APT组织，自2018年以来一直活跃。据传Yellow Liderc隶属于伊斯兰革命卫队(IRGC)，主要攻击地区包括中东、欧洲、北美和南美以及南亚部分地区的机构与组织，攻击目标涉及航空领域、汽车、航空航天和国防、物流、海事和信息技术组织，攻击者常通过网络钓鱼、社会工程学等方式发起攻击，部署其自定义或开源的恶意软件，窃取受害主机的敏感信息。近期，普华永道的研究人员发现，该组织在近期的攻击活动中传播IMAPLoader恶意软件。IMAPLoader恶意软件是一个由.NET编写的DLL文件，主要作为下载器，利用电子邮件与C2服务器进行通信。IMAPLoader恶意软件通过AppDomain Manager注入技术加载特制的.Net程序集。通过导入Windows DLL kernel32.dll和user32.dll，分别调用GetConsoleWindow和ShowWindow API来隐藏Windows控制台窗口。随后，IMAPLoader将查询DLL中硬编码的IMAP帐户，登录账户邮箱，利用WMI查询操作系统版本，创建与远程电子邮件交互的新对象imapClient3，通过Ux.Attachment提取附件，附件将存储在磁盘上与IMAPLoader相同的位置。此外，研究人员还在恶意代码中观察到IMAPLoader通过Ux.EditTask创建持久化机制。攻击链图如下图所示。\n",
    "reference": "https://www.pwc.com/gx/en/issues/cybersecurity/cyber-threat-intelligence/yellow-liderc-ships-its-scripts-delivers-imaploader-malware.html"
  },
  {
    "title": "APT组织Arid Viper针对阿拉伯语用户分发间谍应用程序",
    "txt": "\n近期，Talos的研究人员发现APT组织Arid Viper针对使用阿拉伯语的Android用户发起攻击，攻击者利用其自定义的APK文件感染移动设备，收集敏感信息并部署其他恶意软件。Arid Viper组织是一个传闻疑似与哈马斯有关的APT组织，主要针对中东地区国家实施间谍活动。在本次攻击活动中，Arid Viper组织通过Youtube等社交媒体发送应用程序教程视频，教程会逐步介绍应用程序的所有功能以及如何用阿拉伯语操作该应用程序，并在视频下方附带一个恶意URL，该恶意URL指向攻击者控制的域，可提供伪装成正常软件的恶意软件。这些恶意软件常常伪装成约会程序或者常见的社交程序如WhatsApp、Signal、Telegram等。恶意软件具有多种功能，能够秘密地从受害者的设备收集敏感信息并部署其他可执行文件、检索设备信息、录制通话、记录短信等，恶意软件还会尝试禁用操作系统的系统或安全通知以避免被用户发现异常。经研究人员追踪分析发现，此活动中使用的移动恶意软件与非恶意约会应用程序Skipped有相似之处，尤其是两者在开发平台上使用相似的名称和相同的共享项目。这种重叠表明Arid Viper要么与Skipped的开发人员有联系，要么以某种方式非法访问了共享项目的数据库。研究人员在深入研究后推测Skipped所属公司可能与Arid Viper存在联系。同时该公司旗下还存在多个类似Skipped的约会应用程序，研究人员推测这些软件可能会在Arid Viper的后续攻击活动中出现。",
    "reference": "https://blog.talosintelligence.com/arid-viper-mobile-spyware/"
  },
  {
    "title": "盲眼鹰组织投放Amadey僵尸网络木马活动公开",
    "txt": "\n盲眼鹰是一个疑似来自南美洲的APT组织，于2018年开始活跃，主要针对南美地区国家，包括哥伦比亚、厄瓜多尔、巴拿马等。该组织常对哥伦比亚的政府部门、金融、保险等行业以及大型公司发起攻击。近期，360安全的研究人员发现该组织正在尝试将Amadey僵尸网络木马加入到武器库中。攻击者首先通过鱼叉式钓鱼攻击传递携带恶意代码的PDF文件，PDF文件中包含恶意VBS脚本,当受害者打开PDF文件后，VBS脚本就会执行，并下载后续恶意载荷。恶意载荷包含两种，一种为用于反射加载的net_dll，一种为Amadey木马。net_dll为盲眼鹰组织的惯用组件主要用于建立持久化、加载下一阶段载荷。Amadey木马于2018年10月左右出现，是一个在俄语黑客论坛上出售的模块化僵尸网络木马，具备信息窃取、远程指令执行、脚本执行、DDos攻击等功能。Amadey运行后会从远程服务器下载三个文件，分别是cred.dll、clip.dll、onLyofFicED.bat。其中dll文件是Amadey的信息收集组件，主要用于窃取浏览器账号等用户隐私数据，bat文件中为要执行的恶意脚本。研究人员在对该攻击活动的追踪中发现盲眼鹰组织持续对厄瓜多尔等地区发起攻击，不断地尝试将新的木马工具添加到自身武器库中以完善其攻击能力。攻击链图如下图所示。\n",
    "reference": "https://mp.weixin.qq.com/s/-7U1-NTP0EdVOtptzbHUsg"
  },
  {
    "title": "“田马”组织使用CHM文件对金融行业开展钓鱼活动",
    "txt": "\n近期，腾讯的研究人员发现一个攻击团伙频繁使用CHM文件对金融行业开展钓鱼攻击活动。由于该团伙传播的样本存在\"tianma\"等字样，腾讯安全人员将该黑客团伙命名为田马。攻击者主要通过邮件、即时通信工具传播恶意CHM文件，其隐藏手段主要分为两种，一种直接把CHM文件放入压缩包文件进行传播，一种通过XLS文件内嵌超链接传播压缩包文件。文件名以\"国家税务局补贴政策通知\"作为诱饵，当用户解压诱饵文件后，文件中存在两个文件，其中一个CHM文件(HTML帮助文件)，文件名为\"打不开点击修复\"，另一个BAT文件名为\"税务补贴\"。CHM文件为实际恶意文件，而BAT文件则用于添加启动项，建立持久化。当CHM文件解压后，其中存在一个恶意HTML文件，文件中携带恶意脚本可判断.net版本，执行base64解码后的有效载荷。有效载荷是一个加载器，可用于加载shellcode，shellcode执行后，会从云服务器下载白加黑文件，以执行最终的gh0st木马病毒。当gh0st木马运行成功后，攻击者还会视情况进一步部署远控软件。安全人员持续追踪该团伙后，总结出了该团伙的画像。田马组织主要对中国地区的财务人员、金融从业者、教师等发起攻击，目前只针对Windows平台，常通过邮件、即时通信工具开展攻击活动，常使用的攻击技术为白加黑、内存加载、图片隐写等，主要使用的软件有gh0st木马、大灰狼、正规远控软件等，常使用国内阿里云平台构建基础服务设施。\n",
    "reference": "https://mp.weixin.qq.com/s/PqZfqtvZoeyOSqqnc_QFUA"
  }
]